#include <stdint.h>

// ported from v1 basically

uint16_t us_qwerty_kbd[][98] = {
	{
		u'\0', u'\0', u'1', u'2', u'3', u'4', u'5', u'6', u'7', u'8', u'9', u'0', u'-', u'=', u'\b',
		u'\t', u'q', u'w', u'e', u'r', u't', u'y', u'u', u'i', u'o', u'p', u'[', u']', u'\n',
		u'\0', u'a', u's', u'd', u'f', u'g', u'h', u'j', u'k', u'l', u';', u'\'', u'`',
		u'\0', u'\\', u'z', u'x', u'c', u'v', u'b', u'n', u'm', u',', u'.', u'/', u'\0', u'*',
		u'\0', u' ', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0',
		u'\0', u'\0', u'\0', u'7', u'8', u'9', u'-', u'4', u'5', u'6', u'+', u'1', u'2', u'3', u'0',
		u'.', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0'
	}, {
		u'\0', u'\0', u'!', u'@', u'#', u'$', u'%', u'^', u'&', u'*', u'(', u')', u'_', u'+', u'\b',
		u'\t', u'Q', u'W', u'E', u'R', u'T', u'Y', u'U', u'I', u'O', u'P', u'{', u'}', u'\n',
		u'\0', u'A', u'S', u'D', u'F', u'G', u'H', u'J', u'K', u'L', u':', u'"', u'~',
		u'\0', u'|', u'Z', u'X', u'C', u'V', u'B', u'N', u'M', u'<', u'>', u'?', u'\0', u'*',
		u'\0', u' ', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0',
		u'\0', u'\0', u'\0', u'7', u'8', u'9', u'-', u'4', u'5', u'6', u'+', u'1', u'2', u'3', u'0',
		u'.', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0'
	},
};

uint16_t el_qwerty_kbd[][98] = {
	{
		u'\0', u'\0', u'1', u'2', u'3', u'4', u'5', u'6', u'7', u'8', u'9', u'0', u'-', u'=', u'\b',
		u'\t', u';', u'ς', u'ε', u'ρ', u'τ', u'υ', u'θ', u'ι', u'ο', u'π', u'[', u']', u'\n',
		u'\0', u'α', u'σ', u'δ', u'φ', u'γ', u'η', u'ξ', u'κ', u'λ', u'\0', u'\'', u'`',
		u'\0', u'\\', u'ζ', u'χ', u'ψ', u'ω', u'β', u'ν', u'μ', u',', u'.', u'/', u'\0', u'*',
		u'\0', u' ', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0',
		u'\0', u'\0', u'\0', u'7', u'8', u'9', u'-', u'4', u'5', u'6', u'+', u'1', u'2', u'3', u'0',
		u'.', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0'
	}, {
		u'\0', u'\0', u'!', u'@', u'#', u'$', u'%', u'^', u'&', u'*', u'(', u')', u'_', u'+', u'\b',
		u'\t', u':', u'Σ', u'Ε', u'Ρ', u'Τ', u'Υ', u'Θ', u'Ι', u'Ο', u'Π', u'{', u'}', u'\n',
		u'\0', u'Α', u'Σ', u'Δ', u'Φ', u'Γ', u'Η', u'Ξ', u'Κ', u'Λ', u'\0', u'"', u'~',
		u'\0', u'|', u'Ζ', u'Χ', u'Ψ', u'Ω', u'Β', u'Ν', u'Μ', u'<', u'>', u'?', u'\0', u'*',
		u'\0', u' ', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0',
		u'\0', u'\0', u'\0', u'7', u'8', u'9', u'-', u'4', u'5', u'6', u'+', u'1', u'2', u'3', u'0',
		u'.', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0'
	},
};

uint16_t ru_ytsuken_kbd[][98] = {
	{
		u'\0', u'\0', u'1', u'2', u'3', u'4', u'5', u'6', u'7', u'8', u'9', u'0', u'-', u'=', u'\b',
		u'\t', u'й', u'ц', u'у', u'к', u'е', u'н', u'г', u'ш', u'щ', u'з', u'х', u'ъ', u'\n',
		u'\0', u'ф', u'ы', u'в', u'а', u'п', u'р', u'о', u'л', u'д', u'ж', u'э', u'ё',
		u'\0', u'\\', u'я', u'ч', u'с', u'м', u'и', u'т', u'ь', u'б', u'ю', u'.', u'\0', u'*',
		u'\0', u' ', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0',
		u'\0', u'\0', u'\0', u'7', u'8', u'9', u'-', u'4', u'5', u'6', u'+', u'1', u'2', u'3', u'0',
		u'.', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0'
	}, {
		u'\0', u'\0', u'!', u'"', u'№', u';', u'%', u':', u'?', u'*', u'(', u')', u'_', u'+', u'\b',
		u'\t', u'Й', u'Ц', u'У', u'К', u'Е', u'Н', u'Г', u'Ш', u'Щ', u'З', u'Х', u'Ъ', u'\n',
		u'\0', u'Ф', u'Ы', u'В', u'А', u'П', u'Р', u'О', u'Л', u'Д', u'Ж', u'Э', u'Ё',
		u'\0', u'/', u'Я', u'Ч', u'С', u'М', u'И', u'Т', u'Ь', u'Б', u'Ю', u',', u'\0', u'*',
		u'\0', u' ', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0',
		u'\0', u'\0', u'\0', u'7', u'8', u'9', u'-', u'4', u'5', u'6', u'+', u'1', u'2', u'3', u'0',
		u'.', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0'
	}
};

uint16_t fr_bepo_kbd[][98] = {
	{
		u'\0', u'\0', u'"', u'«', u'»', u'(', u')', u'@', u'+', u'-', u'/', u'*', u'=', u'%', u'\b',
		u'\t', u'b', u'é', u'p', u'o', u'è', u'\0', u'v', u'd', u'l', u'j', u'z', u'w', u'\n',
		u'\0', u'a', u'u', u'i', u'e', u',', u'c', u't', u's', u'r', u'n', u'm', u'$',
		u'\0', u'ç', u'à', u'y', u'x', u'.', u'k', u'\'', u'q', u'g', u'h', u'f', u'\0', u'*',
		u'\0', u' ', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0',
		u'\0', u'\0', u'\0', u'7', u'8', u'9', u'-', u'4', u'5', u'6', u'+', u'1', u'2', u'3', u'0',
		u'.', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0'
	}, {
		u'\0', u'\0', u'1', u'2', u'3', u'4', u'5', u'6', u'7', u'8', u'9', u'0', u'°', u'`', u'\b',
		u'\t', u'B', u'É', u'P', u'O', u'È', u'!', u'V', u'D', u'L', u'J', u'Z', u'W', u'\n',
		u'\0', u'A', u'U', u'I', u'E', u';', u'C', u'T', u'S', u'R', u'N', u'M', u'#',
		u'\0', u'Ç', u'À', u'Y', u'X', u':', u'K', u'?', u'Q', u'G', u'H', u'F', u'\0', u'*',
		u'\0', u' ', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0',
		u'\0', u'\0', u'\0', u'7', u'8', u'9', u'-', u'4', u'5', u'6', u'+', u'1', u'2', u'3', u'0',
		u'.', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0', u'\0'
	}
};

uint16_t (* layer0_kbd_layout)[][98];
uint16_t (* layer1_kbd_layout)[][98];
uint16_t (* layer2_kbd_layout)[][98];

uint16_t (*layout_get_layer(int layer))[][98] {
	switch (layer) {
		default:
		case 0:
			return layer0_kbd_layout;
		case 1:
			return layer1_kbd_layout;
		case 2:
			return layer2_kbd_layout;
	}
}

void switch_layer(int layer, uint16_t (* layout)[][98]) {
	switch (layer) {
		default:
			return;
		case 0:
			layer0_kbd_layout = layout;
		case 1:
			layer1_kbd_layout = layout;
		case 2:
			layer2_kbd_layout = layout;
	}
}

void layout_init() {
	layer0_kbd_layout = &us_qwerty_kbd;
	layer1_kbd_layout = &el_qwerty_kbd;
	layer2_kbd_layout = &ru_ytsuken_kbd;
}
